In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique() #encontrar os valores unicos de uma coluna

array([444, 555, 666], dtype=int64)

In [4]:
df['col2'].nunique() #nº de valores unicos

3

In [5]:
df['col2'].value_counts() #conta quantas vezes ocorrem

444    2
555    1
666    1
Name: col2, dtype: int64

In [6]:
def times2(x):
    return x*2

In [9]:
df['col2'].apply(times2) #aplicamos a funçao, neste caso o valor da coluna x 2

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [10]:
df['col2'].apply(lambda x: x*2) #substitui a criaçao de uma função

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [11]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
#df.drop['col1', axis=1,inplace=True] remove a coluna 1

In [14]:
df.columns #index das colunas da DF

Index(['col1', 'col2', 'col3'], dtype='object')

In [15]:
df.index #diz-nos o valor inicial e o final e de quanto em quanto avança

RangeIndex(start=0, stop=4, step=1)

In [16]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [18]:
df.sort_values('col2') #poe os valores da coluna 2 em ordem

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [19]:
df.isnull() #verifica a existencia de nulls

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [20]:
data = {'A':['foo','foo','foo','bar','bar','bar'],'B':['one','one','two','two','one','one'], 'C':['x','y','x','y','x','y'], 'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [21]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [23]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN